#2.1
'''
    *
   * *
  *   *
 *     *
***   ***
  *   *
  *   *
  *****
'''

# Простой вариант
print("    *")
print("   * *")
print("  *   *")
print(" *     *")
print("***   ***")
print("  *   *")
print("  *   *")
print("  *****")

# С переносами
print("    *\n   * *\n  *   *\n *     *\n***   ***\n  *   *\n  *   *\n  *****",sep="\n")

# С разделителем
print("    *","   * *","  *   *"," *     *","***   ***","  *   *","  *   *","  *****",sep="\n")

'''
n=1;
print(" "*5*n,"*");
print(" "*4*n,"*",sep="",end="");print(" "*2*n,"*")
print(" "*2*n,"*",sep="",end="");print(" "*2*n,"*")
'''
